[
  {
    "index": 1,
    "name": "Hanging Garden",
    "description": "This room’s ceiling covered with amphibious plants. Light dapples the floor colored yellow-green by the quartz and plant matter above you. The plants in this room are grown in organized rows on the ceiling. In the room are 1D4 [+] Hermits, who move from row to row, pruning and checking on their Slugs. They seem very diligent and mostly ignore you. The Hermits will attempt to communicate using Crustacean. They will be willing to trade some of their harvest for 250S each Slug, and they will happily barter. Roll three times on the Slug table to determine what Slugs are for sale.",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 2,
    "name": "Open Water",
    "description": "A very open room. The current canals pulse regularly with the glowing algae as water flows along the tracks here. Occasionally something flows in through the channels. Roll 1D6 to determine what floats in via the many channels. 1. 3 Chum float through. 2. A Sack of Loot floats past. Roll three times on the Loot Table. 3-4. Someone sent the dead’s Sand down. Gain 500 Sand. 5. A Dead Chum floating on its back, it’s holding a wooden figurine. Roll for a random Spell, this figurine functions as a Spell Pearl of that Spell. 6. An Eelaconda enters.",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 3,
    "name": "The Great Currents",
    "description": "You are inside of a globe and its walls are a map. In five different large areas of what you can assume must symbolize oceans there is soft clay. Surrounded by continents that are made of stone. In the center of the room is a pedestal and sticking out of the center vertically is a rod made of driftwood with a coral tip. Beneath it, on the pedestal is a sentence written in the language of the gods. It says, “Hot to cold, and cold to hot; never stop, never stop; if they do, we all drop.” If the Heirs choose to investigate the room: Near the equator in each of the clay spaces there is a small hole in the clay constantly burbling warm water. Near the poles of this inverted globe are small holes in the clay burbling cold water. Three cold water springs are at the northern pole and three more are at the southern pole. There are six warm springs along the equator. Solution: If the Heirs push the rod into the soft clay near the spigot the water will follow the channel they create. The goal is to create six channels that circulate warm water to cold and vice-versa in a loop. If they do this the walls of clay melt down and reveal a chest. Roll on the Treasure table.",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 4,
    "name": "Sinking Ship",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 5,
    "name": "Whirlpool Well",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 6,
    "name": "Seagrass Plains",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 7,
    "name": "Spawning Pool",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 8,
    "name": "Driftwood Pile",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 9,
    "name": "Gullture Eerie",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 10,
    "name": "Chum Nest",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 11,
    "name": "Upside Down Brush",
    "description": "",
    "hallways": 0,
    "danger": 0
  },
  {
    "index": 12,
    "name": "The Shelf",
    "description": "",
    "hallways": 0,
    "danger": 0
  }
]
